"""
--------------------------------
@Time    :  2022/1/24 - 15:46 
@Author  :  Lee
@File    :  python_basic47 
--------------------------------
"""

"""
函数传递值的方式: 值传递、引用传递

值传递: 传递的是变量的值而非变量本身,被传递的变量的值不会被改变
引用传递: 传递的是变量本身,被传递的变量的值会被改变

注意:
1.可变类型(list/set/dict)用的是 引用传递
2.不可变类型(number/str/tuple)用的是 值传递
"""


def fun1(a):
    a += 1
    print(a)


a1 = 10
fun1(a1)  # 11  值传递,调用fun1()函数,并且把a1的值10传送给fun1()函数的参数a
print(a1)  # 10


def fun2(lst):
    lst.append([5, 6])
    print(lst)


list1 = [1, 2, 3, 4]
fun2(list1)  # [1,2,3,4,[5,6]]
print(list1)  # [1,2,3,4,[5,6]]
