"""
--------------------------------
@Time    :  2022/1/18 - 14:17 
@Author  :  Lee
@File    :  python_basic23 
--------------------------------
"""

"""
python的数据库类型: number数字/str字符串/list列表/tuple元组/set集合/dict字典

可变类型:列表、集合、字典
不可变类型:数字、字符串、元组

有序的:字符串、列表、元组
无序的:数字、集合、字典
"""

# 1.区分重新赋值和更改内容
a = 100
a = 200  # 重新赋值,属于变量值的覆盖

b = [1, 2, 3]
b[1] = 100  # 此处是更改内容

# 2.可变类型可以修改内容,比如列表类型
c = [1, 2, 3, 4, 5]
print('修改前的物理地址是:', id(c))
c[0] = '小花'
c.append('小美')
print(c)
print('修改后的物理地址是:', id(c))

# 3.不可变类型不能修改内容
tup1 = (10, 20, 30, 40)
# tup1[0] = '小刘'  # 元组类型不支持该操作 TypeError: 'tuple' object does not support item assignment

