"""
--------------------------------
@Time    :  2022/1/18 - 14:46 
@Author  :  Lee
@File    :  python_basic24 
--------------------------------
"""

"""
面试问题:
1.什么是栈、堆
2.小整数池和大整数池的作用
3.is和==的区别
"""

"""
查看存储地址的函数:id()
"""

a = 100
b = 100
print("a的地址是:", id(a))  # a的地址是: 140704724672640
print("b的地址是:", id(b))  # b的地址是: 140704724672640

a = 99999999999999
b = 99999999999999
print("a的地址是:", id(a))  # a的地址是: 2783885252016
print("b的地址是:", id(b))  # b的地址是: 2783885252016

# 身份运算符 is (判断两个标识符是否同一对象,直接比对物理地址)
# is not (判断两个标识符是否不是同一对象,直接比对物理地址)
a = 100
b = 100
print(id(a), '*******', id(b))  # 140704724672640 ******* 140704724672640
print(a is b)  # True

b = 30
print(id(a), '*******', id(b))  # 140704724672640 ******* 140704724670400
print(a is b)  # False
print(a is not b)  # True
