"""
--------------------------------
@Time    :  2022/1/17 - 14:15 
@Author  :  Lee
@File    :  python_basic21 
--------------------------------
"""

"""
循环嵌套
"""

print(1)  # 打印1 并且换行
print(2, end='')  # 打印2 并且不换行
print()

# 打印一个4行5列的长方形
# *****
# *****
# *****
# *****

for i in range(4):  # 0,1,2,3
    print('*****')

print('===' * 50)

# 要求你只能使用单个 * 完成
# for j in range(5):
#     print('*', end='')
# print()

# 外循环循环一次,内循环必须执行循环完成
for i in range(4):  # 外循环,i = 0,1,2,3
    for j in range(5):  # 内循环  01234  01234  01234 01234
        print('*', end='')
        # *****
        # *****
        # *****
        # *****
    print()  # 打印完一行 * 之后换行

# 打印一个直角三角形
# *
# **
# ***
# ****
# 一共4行,外循环循环4次,第一次循环打印1个 * 第二次循环打印2个 ** 第三次循环打印3个 *** 第四次循环打印4个 ****
for i in range(4):  # 外循环  i = 0,1,2,3
    for j in range(i + 1):
        print('*', end='')
        # *
        # **
        # ***
        # ****
    print()

print('===' * 50)

# 打印99乘法口诀表
# 1*1=1
# 1*2=2 2*2=4
# 1*3=3 2*3=6 3*3=9
# 1*4=4 2*4=8 3*4=12 4*4=16
# .......

for i in range(1, 10):  # 123456789
    for j in range(1, i + 1):  # 123456789
        print('{}*{}={} '.format(j, i, i * j), end='')
        # 1*1=1
        # 1*2=2 2*2=4
        # 1*3=3 2*3=6 3*3=9
        # 1*4=4 2*4=8 3*4=12 4*4=16
        # .....
    print()
