"""
--------------------------------
@Time  :  2022/1/11 - 17:39 
@Author:  Lee
@File  :  random_name 
--------------------------------
"""
import random

name = ['崔慧琪', '高亭亭', '杨慧芬', '舒园园', '吴唤雨', '艾朝望', '李志鹏', '马芸  ', '王玮  ', '苏坡  ', '谢子君', '宋阳立', '符进军', '张甜甜',
        '李元  ', '刘中丽', '程海洋', '张硕  ', '张厚菊', '谭云辉', '陈慧斌', '陈惠敏', '赵泰  ', '黄竞  ', '孙朋琴', '胡金童', '温进  ', '孙浩  ',
        '宋四雷', '孙培齐', '唐琦  ', '仇璐  ', '梁二帅', '张贺广', '王鹏  ', '高忍', '张杰  ', '杨华林', '顾春潮', '赵艳仙', '王天成', '甄新月',
        '石娜  ', '陈亚婷', '林海  ', '江凯  ', '袁描粤', '黄勤箭', '刘宁宁', '王振全', '徐园荣', '刘元森', '宋春虎', '李晓玲', '张洲  ',
        '马兴宏', '周美林', '张盈盈', '王群', '吴岩']

print(random.choice(name))
