"""
--------------------------------
@Time    :  2022/1/19 - 15:37 
@Author  :  Lee
@File    :  python_basic29 
--------------------------------
"""

"""
作用域:为了编写可维护代码,我们很多代码放在不同的区域中
模块:一个.py文件称之为一个模块
"""

# 知识点1: 变量的作用域:变量分为全局变量(定义在模块,任何地方都可以使用)和局部变量(定义在函数中,只有该函数内有效)
a = 100  # 全局变量,定义在模块中


def fun1():
    b = 200  # b是局部变量,定义在函数中,只在该函数内有效
    print(a)  # a可以打印,因为a是全局变量,在整个模块都可以使用
    print(b)  # b也可以打印,因为b属于fun1()函数


fun1()
# print(b)  # 该行代码报错,因为b属于fun1()函数,只能在fun1()函数内使用

print('===' * 50)

# 知识点2: global  可以在函数内使用全局变量,只有该函数运行后,该变量才会起作用
c = 100


def fun2():
    global c
    c = 300
    print(c)


# print(c)  # 100
fun2()  # 300
print(c)  # 300

print('===' * 50)


# 知识点3: 函数嵌套
def fun3():
    a = 10

    def fun4():
        print("内部函数")

    fun4()  # 调用fun4()函数
    print(a)


fun3()

print('===' * 50)


# 知识点4: nonlocal  用来修改外部嵌套函数作用域的值,nonlocal只能写在嵌套函数中
def fun5():
    a = 10

    def fun6():
        nonlocal a
        a = 20
        print(a)  # 20

    fun6()  # 调用fun6()函数
    print(a)  # 20


fun5()
